<!-- on zvonok reaction -->
<script src="/canvas2image.js"></script>
<script src="https://cdn.jsdelivr.net/npm/@alxcube/lens@1.0.0/dist/lens.min.js"></script>
<script type="text/javascript">
    var haha130 = ["Какое слово всегда пишется неправильно? ", "Сколько месяцев в году имеют 28 дней?", "С какой скоростью должна двигаться собака (в возможных для неё пределах), чтобы не слышать звона сковородки, привязанной к ее хвосту?", "Собака была привязана к десятиметровой веревке, а прошла по прямой двести метров. Как ей это удалось?", "Как спрыгнуть с десятиметровой лестницы и не ушибиться?", "Что можно видеть с закрытыми глазами?", "Что в огне не горит и в воде не тонет?", "Кого австралийцы называют морской осой?", "Что нужно делать, когда видишь зелёного человечка?", "Москву раньше называли белокаменной. А какой город называли чёрным?", "Жители средневековой Европы иногда привязывали к подошвам деревянные чурки. С какой целью они это делали?", "В каком процессе вода заменила солнце, через 600 лет ее заменил песок, а еще через 1100 лет всех их заменил механизм?", "В прежние времена амбары строили на отшибе, подальше от жилищ. С какой целью?", "При Петре I на гербе Российской империи был изображён орёл, держащий в лапах карты четырёх морей. Перечислите их.", "Название какого германского племени дало имя целой европейской стране?", "Почему в дикой природе белые медведи не едят пингвинов?", "Не желая признавать, что Красная армия могла нанести им поражение, немцы утверждали, что Великую Отечественную войну выиграли генерал Мороз, генерал Грязь и генерал Мышь. По поводу мороза и грязи все понятно. А вот при чем тут мышь?", "Назовите пять дней, не называя чисел (1, 2, 3,..) и названий дней (понедельник, вторник, среда…)", "У тридцати двух воинов один командир.", "Двенадцать братьев\nДруг за другом бродят,\nДруг друга не обходят.", "Как правильно говорить: «не вижу белый желток» или «не вижу белого желтка»?", "Можно ли зажечь обычную спичку под водой, чтобы она догорела до конца?", "Когда черной кошке лучше всего пробраться в дом?", "Шли два отца и два сына, нашли три апельсина. Стали делить — всем по одному досталось. Как это могло быть?", "Из какой посуды нельзя ничего поесть?", "Маленький, серенький на слона похож. Кто это?", "Какой рукой лучше размешивать чай?", "Стучат, стучат — не велят скучать.\nИдут, идут, а всё тут как тут.", "Очень быстрых два коня\nПо снегам несут меня —\nЧерез луг к березке,\nТянут две полоски.", "Когда человек бывает в комнате без головы?", "На какой вопрос нельзя ответить «да»?", "На какой вопрос нельзя ответить «нет»?", "Когда сеть может вытянуть воду?", "Смелый как …,\nковарная как …,\nтрусливый как …,\nхитрый как …,\nзлой как …,\nголодный как …,\nтрудолюбивый как …,\nверный как …,\nупрямый как …,\nбестолковый как …,\nтихий как …,\nвольный как ….", "Чем оканчиваются день и ночь?", "Сорока летит, а собака на хвосте сидит. Может ли это быть?", "Что надо сделать, чтобы пять парней остались в одном сапоге?", "Сколько будет 2+2*2?", "В каком месяце болтливая Светочка говорит меньше всего?", "Что принадлежит вам, однако другие им пользуются чаще, чем вы?", "Как найти прошлогодний снег?", "Какое слово всегда звучит неверно?", "У человека — одно, у коровы — два, у ястреба – ни одного. Что это?", "Сидит человек, но вы не можете сесть на его место, даже если он встанет и уйдёт. Где он сидит?", "Каких камней в море нет?", "Какой знак нужно поставить между 4-мя и 5-ю, чтобы результат оказался больше 4-х и меньше 5-ти?", "Может ли петух назвать себя птицей?", "Какой болезнью на земле никто не болел?", "Можно ли предсказать счёт любого матча до его начала?", "Что можно приготовить, но нельзя съесть?", "Какая цифра уменьшится на треть, если её перевернуть?", "У квадратного стола отпилили один угол по прямой линии . Сколько теперь углов у стола?", "Какой узел нельзя развязать?", "Что у коровы впереди, а у быка позади?", "Какая река самая страшная?", "Что не имеет длины, глубины, ширины, высоты, а можно измерить?", "Что все люди на земле делают одновременно?", "Два человека играли в шашки. Каждый сыграл по пять партий и выиграл по пять раз. Это возможно?", "Как может брошенное яйцо пролететь три метра и не разбиться?", "Мужчина вел большой грузовик. Фары на машине не были зажжены. Луны тоже не было. Женщина стала переходить дорогу перед машиной. Как удалось водителю разглядеть ее?", "Где край света?", "Человек научился у пауков строить подвесные мосты, у кошек перенял диафрагму в фотоаппарате и светоотражающие дорожные знаки. А какое изобретение появилось благодаря змеям?", "Что с земли легко поднимешь, но далеко не закинешь?", "Каким гребнем голову не расчешешь?", "Что бросают, когда нуждаются в этом, и поднимают, когда в этом нет нужды?", "Что может путешествовать по свету, оставаясь в одном и том же углу?", "Вы сидите в самолёте, впереди вас лошадь, сзади автомобиль. Где Вы находитесь?", "Какими нотами можно измерить расстояние?", "Что не войдёт в самую большую кастрюлю?", "Русская загадка. Деревянная река, деревянный катерок, а над катером струится деревянный дымок. Что это?", "Один оборот вокруг Земли спутник делает за 1 час 40 минут, а другой за 100 минут. Как такое может быть?", "Назовите хотя бы трёх животных, которых Моисей взял в свой ковчег?", "В одной руке мальчик нёс один килограмм железа, а в другой столько же пуха. Что было тяжелее нести?", "В 1711 году в каждом полку русской армии появилось новое подразделение численностью в 9 человек. Что это за подразделение?", "На первом месте чайки, далее – чибисы, скворцы, голуби. Все они являются главными виновниками… Каких трагедий?", "Известна история о маленьком мальчике, который, получив новогодний подарок, попросил маму: «Сними, пожалуйста, крышку. Я хочу подарок погладить». Что же это за подарок?", "Какие животные всегда спят с открытыми глазами?", "Известно, что в свое время под страхом смерти из Китая были вывезены яйца тутового шелкопряда. А какое животное было вывезено в 1888 г. с таким же риском из Афганистана?", "Какие насекомые одомашнены человеком?", "Задача, придуманная ученым монахом и математиком из Ирландии Алкуином (735–804).\nКрестьянину нужно перевезти через реку волка, козу и капусту. Но лодка такова, что в ней может поместиться только крестьянин, а с ним или один волк, или одна коза, или одна капуста. Но если оставить волка с козой, то волк съест козу, а если оставить козу с капустой, то коза съест капусту. Как перевез свой груз крестьянин?", "В старину на Руси замужние женщины носили головной убор кокошник, название которого произошло от слова «кокошь», означающий животное. Какое?", "Почему дикобраз не может утонуть?", "Назовите пятую по площади страну после России, Китая, Канады и США.", "Мужик пошел на базар и купил там лошадь за 50 рублей. Но вскоре он заметил, что лошади подорожали, и продал ее за 60 рублей. Потом он сообразил, что ехать ему не на чем, и купил ту же лошадь за 70 рублей. Затем он задумался, как бы не получить от жены нагоняй за такую дорогую покупку, и продал ее за 80 руб. Что он заработал в результате манипуляций?", "Единственная птица, у которой есть ушные раковины?", "Двое одновременно подошли к реке. Лодка, на которой можно переправиться, выдерживает только одного человека. И все же без посторонней помощи каждый переправился на этой лодке на другой берег. Как им это удалось?", "В китайском языке сочетание трех иероглифов «дерево» означает слово «лес». А что означает сочетание двух иероглифов «дерево»?", "Жители штата Канзас очень любят русские орешки. Что это такое, если известно, что у нас их можно встретить на любом рынке?", "Римляне внесли в конструкцию вилки революционное новшество – все последующие модели стали лишь вариациями найденного решения. А какой вилка была до этого новшества?", "Китайские мастера боевых искусств говорили, что драка – для дураков, для умных – победа. А что, по их мнению, – для мудрых?", "Назовите язык, являющийся родным для наибольшего количества людей.", "В Древней Руси их называли ломаными числами. Как их называют в настоящее время?", "Кирпич весит два килограмма и пол кирпича. Сколько килограммов весит кирпич?", "Эти люди для чего-то, возвращаясь к себе на родину, привозили с собой ветви экзотических растений, за что и получили свое прозвище. Что это за люди?", "По объему производства бананы занимают первое место в мире, на втором месте – цитрусовые. Какие фрукты на третьем?", "В американском штате Аризона начали охранять пустыню от воров. Крадут то, без чего пустыни угрожает запустение и опустошение. Что же вывозят воры из пустыни?", "Назовите растение, у которого самые большие плоды.", "Ни рыба ни мясо – о чем эта русская поговорка была первоначально?", "В Испании их называют португальцами, в Пруссии – русаками. А как их называют в России?", "Кого ловят малайцы с помощью запертой бамбуковой клетки с живым поросенком внутри?", "У ежа 4 г, у собаки – 100 г, у лошади – 500 г, у слона – 4-5 кг, у человека – 1,4 кг. Чего?", "В 1825 году улицы Филадельфии очищались от мусора домашними животными. Какими?", "Какое блюдо придумал в 17 веке Марко Арони?", "Что теряет в полёте любой космонавт?", "Как известно, все исконно русские женские (полные) имена зканчиваются либо на А, либо на Я: Анна, Мария, Ольга и т.д. Однако есть одно женское имя, которое не оканчивается ни на А, ни на Я. Назовите его.", "Галльские жрецы нашли безотказный способ быстрой мобилизации воинов в случае войны. Для этого они приносили в жертву только одного человека. Какого?", "Однажды в городе Ницце провели конкурс на самого выносливого курильщика. Один из участников установил рекорд, выкурив 60 сигарет подряд. Однако приза он не получил. Почему?", "У человека двенадцать пар рёбер. А у кого рёбер около трёхсот?", "Во рту – дудка, в руке – бубен, под мышкой – харя. Так изображали на Руси скоморохов. Насчет дудки и бубна все ясно, а вот что такое харя?", "Всем известно, что «нельзя выносить сор из избы». А что все-таки с ним полагалось делать, если выносить нельзя?", "В каком месте русские мужики надевали шапки и рукавицы, независимо от времени года?", "Чем рыба колюшка похожа на птиц?", "Какая трава самая высокая?", "Назовите сельскохозяйственную культуру, которая на 90% сгорает, а на 10% выбрасывается.", "Греки использовали это для защиты определенных частей своего тела. Это изготавливалось из коры сандалового дерева. Назовите это.", "Первые оранжереи появились во Франции. Как вы думаете, для чего?", "Обладателем самого большого рога является белый носорог (до 158 см). А у какого животного самые мягкие рога?", "Именно это использовали футбольные арбитры до того, как стали применять свисток.", "Что считается грязным, когда оно белое, и чистым, когда оно зелёное?", "На практике при движении по кривой этот шарик делает 5000 оборотов в минуту, а при движении по прямой более 20000 оборотов в минуту. Где этот шарик находится?", "У великого Гиппократа спросили: «Правда ли, что гениальность – это болезнь?» «Безусловно, – ответил Гиппократ, – но очень редкая.» Какое еще свойство этой болезни отметил с сожалением Гиппократ?", "Как назывался город в Англии, где в 1873 году впервые была продемонстрирована популярная и по сей день индийская игра?", "Где, судя по названию, древние славяне крепили чехол для охотничьего холодного оружия?", "У трёх маляров был брат Иван, а у Ивана братьев не было. Как это могло быть?", "У русских князей были различные прозвища, которые происходили от названия городов (Владимирский, Черниговский, Галицкий), от ярких личных качеств (Удалой, Мудрый, Калита). Какое прозвище получил князь Всеволод, имевший двенадцать детей?", "В 1240 г. в Киевской Руси впервые была проведена перепись населения. Кто и с какой целью это сделал?", "Шел 988 год… Многочисленная толпа жителей древнего Киева для чего-то двигалась к Днепру. Как назвали дорогу, по которой шли горожане?", "Россия состояла из Великороссии (собственно России), Малороссии (Украины), Белой Руси (Белоруссии). А как называли Маньчжурию, входившую в состав этого государства?", "Итальянский флаг красно-бело-зеленого цвета. Какая ягода в разрезе помогла итальянцам выбрать эти цвета?\nСократ занимался этим «в целях обострения мысли». Так же поступал и Сенека. Горация таким способом вылечили от тяжелой болезни. Большим любителем этого был Суворов. Любили заниматься этим и А.С.Пушкин и Л.Н.Толстой. Чем же они занимались?", "Как раньше в России называли философа?", "Какой цветок считался символом королевской власти?", "Если тюрки хотели сказать «охраняй селение», они говорили «кара авыл». А как мы говорим сейчас?", "Древние римляне носили тунику. А что они носили, когда наступали холода?", "Как по-татарски будет «обувь»?", "Мы, в основном, пользуемся только началом этой поговорки, а ее конец: «…только хвостом подавился»?", "Скажите по-датски «Оле, закрой глазки».", "По этому предмету одежды легко узнавали варваров.", "У какого литературного персонажа были 300-летние мозоли?", "Этих трёх братьев можно назвать зодчими.", "Как известно, дед Мазай спас от наводнения множество зайцев. Назовите человека, спасшего во время пожара восемнадцать голубей и воробья.", "Какими словами начинается пословица, если её окончание звучит так: «…а коровы яйца несут»?", "Какими словами начинается пословица, если её окончание звучит так: «…будет и Великий пост»?", "Как начинается пословица: «…велик пень, да дуплист»?", "Всем известно выражение «Беречь как зеницу ока». А что такое «зеница ока»?", "Это слово дословно означает «то, что будет после утра». Что же это за слово?", "Он очень хотел стать настоящим мальчиком и в конце концов стал им. Кто он?", "Какой сказочный герой от рождения владел тремя языками?", "На Руси его ели повсеместно, римляне называли его смрадным растением, а Пифагор называл королем пряностей. Назовите его.", "До появления картофеля это служило главной пищей бедных слоев населения Европы. А нам это более известно по короткому произведению с шестью персонажами.", "Что это за растение, которое олицетворяет собой одновременно и родного, и приёмного родственника?", "Среди всех огородных сорняков она, по мнению народной медицины, является очень полезной, особенно если с ней приготовить салат…", "Русская загадка: «Красна девица, а сердце – каменное». Что это?", "У каких мирных кораблей не капитаны, а командиры?", "Назовите самый популярный вид транспорта на лесозаготовках в труднодоступных районах Азии.", "Когда-то в русской армии служил офицер по фамилии Сиверст-Меринг, прославившийся, подобно барону Мюнхаузену, неуемной фантазией. Какой фразеологизм родился в связи с его именем?", "У него есть четыре, но если их все отрезать, то у него станет целых восемь. О чем идет речь?", "Екатерина II скупала по всему миру произведения искусства, чтобы поместить их в «уединенном убежище». Как мы его теперь называем?", "Юлий Цезарь приказал своим солдатам украсить щиты и оружие драгоценностями. Зачем?", "Чем бег отличается от ходьбы? Прежде чем ответить на этот вопрос, вспомните, что бег может быть медленнее, нежели иная ходьба, и что бывает даже бег на месте.", "В больницу города Кукуева направляли всех пострадавших в результате несчастных случаев в городе. Больше всего было водителей и пассажиров, пострадавших в ДТП. Чтобы уменьшить их число, городские власти сделали обязательным пользование ремнями безопасности. Водители и пассажиры стали пристегиваться этими ремнями, но число ДТП осталось неизменным, а число пострадавших в них людей, которые поступали в больницу, даже увеличилось. Почему?", "У дороги на посту стоят два часовых. Один смотрит в одну сторону дороги, а другой – в противоположную, но при этом они видят друг друга. Как такое может быть? Варианты с отражениями и т.п. – исключены.", "Если в 12 часов ночи идет дождь, то можно ли ожидать, что через 72 часа будет солнечная погода?", "Имеется круглое глубокое озеро диаметром 200 метров и два дерева, одно из которых растет на берегу у самой воды, другое – по центру озера на небольшом островке. Человеку, который не умеет плавать, нужно перебраться на островок при помощи веревки, длина которой чуть больше 200 метров. Как ему это сделать?", "Человек живет на 17-м этаже. На свой этаж он поднимается на лифте только в дождливую погоду или тогда, когда кто-нибудь из соседей с ним едет в лифте. Если погода хорошая и он один в лифте, то он едет до 9-го этажа, а дальше до 17-го этажа идет пешком по лестнице… Почему?", "Одного человека спросили:\n— Сколько вам лет?\n— Порядочно, — ответил он.\n— Я старше некоторых своих родственников почти в шестьсот раз. Как такое может быть?", "Люди, приезжавшие в одну деревушку, часто удивлялись местному дурачку. Когда ему предлагали выбор между блестящей 10-рублевой монетой и мятой сторублевой купюрой, он всегда выбирал монету, хотя она стоит вдесятеро меньше купюры. Почему он никогда не выбирал купюру?", "Позавчера Пете было 17 лет. В следующем году ему исполнится 20 лет. Как такое может быть?", "Один король хотел сместить своего премьер-министра, но при этом не хотел его слишком обидеть. Он позвал премьер-министра к себе, положил при нем два листка бумаги в портфель и сказал: «На одном листке я напи­сал «Уходите», а на втором — «Останьтесь». Листок, который вы вытащите, решит вашу судьбу». Премьер-министр догадался, что на обоих листках было написано «Уходите». Как же, однако, умудрился он при этих условиях сохранить свое место?", "Один джентльмен, показывая своему другу портрет, нарисованный по его заказу одним художником, сказал: «У меня нет ни сестер, ни братьев, но отец этого человека был сыном моего отца».", "В парке 8 скамеек. Три покрасили. Сколько скамеек стало в парке?", "Термометр показывает плюс 15 градусов. Сколько градусов покажут два таких термометра?", "Батон разрезали на три части. Сколько сделали разрезов?", "Что легче 1 кг ваты или 1 кг железа?", "Грузовик ехал в деревню. По дороге он встретил 4 легковые машины. Сколько машин ехало в деревню?", "Два раза родится, один раз умирает. Кто это?", "Что с пола за хвост не поднимешь?", "Что всегда увеличивается и никогда не уменьшается?", "Чем больше из нее берешь, тем больше становится. Что это?", "В 9-этажном доме есть лифт. На первом этаже живет 2 человека, на втором 4 человека, на третьем 8 человек, на четвертом 16, на пятом 32 и так далее. Какая кнопка в лифте этого дома нажимается чаще других?", "Что идет то в гору, то с горы, но остается на месте?", "На дереве сидели 7 воробьёв, одного из них съела кошка. Сколько воробьёв осталось на дереве?", "К тебе пришли гости, а в холодильнике бутылка лимонада, пакет с яблочным соком и бутылка минеральной воды. Что ты откроешь в первую очередь?", "Какой русский город летает?", "Что сырым не едят, а сварят – выбросят?", "Какие два слова в русском языке пишутся с тремя буквами «е» подряд?", "Когда европейцы привезли ее на Таити, то островитяне, никогда прежде не видевшие ничего подобного, окрестили ее свиньей с зубами на голове. Как называем ее мы?", "В Таиланде существуют школы для обезьян. Чему в них учат?", "Как, по мнению ученых, крокодил избавляется от избытка солей в организме?", "Одна из японских авиакомпаний рисует на носу своих самолетов огромные глаза. Зачем?", "Почему птицы для отлета осенью выбирают холодный день, а весной прилетают в тёплый?", "По мнению писателя О’Генри, она – единственное животное, в которое забивают гвозди. Кто это?", "Из кожи именно этого животного были впервые изготовлены напильники, которыми полировали дерево и даже мрамор.", "Какое животное занимает второе место после человека по количеству изображений на пьедесталах?", "Отсутствие какого органа не позволяет акулам останавливаться хоть на миг, иначе они просто утонут?", "У кого зубы в желудке?", "До XVI в. в природе существовали ее сорта только белого и желтого цвета. Однако голландские селекционеры, поклонники герцога Оранского, вывели известный в настоящее время cорт патриотичного цвета. О чем речь?", "Судя по названию этой страны, она должна состоять в основном из равнин и степей. Тем не менее большая часть равнин ей уже не принадлежит, а в настоящее время около половины ее территории занимают горы, холмы и леса. Что это за страна?", "Территория Финляндии на 8% покрыта озерами. Хотя она и называется страной тысячи озёр (а их количество значительно больше), но первенство принадлежит другой. Какой?", "Какой металл встречается в природе реже чем платина или уран, однако до последнего времени был почти в каждом доме?", "В каком штате США на 50 мужчин приходится одна женщина?", "Существует что-то такое хрупкое, что даже произнеся его имя, вы его нарушите. Что это?", "В 1086 г. сестра Владимира Мономаха открыла школу при одном из киевских монастырей. Чем эта школа отличалась от всех существовавших на Руси до этого?", "Где впервые был обнаружен картофель?", "Как написать «девятнадцать», а затем, убрав единицу, получить «двадцать»?", "Накормите его, и он оживет. Напоите его, и он умрет. Что это такое?", "Что имеет 5 пальцев, но при этом не является живым существом.", "Я – ничто, но у меня есть название. Иногда бываю большой, иногда маленькой и не могу существовать в одиночку. Кто я?", "На что больше всего похожа половина апельсина?", "Какая деталь книжного шкафа состоит из половины согласной буквы?", "Сколько концов у трех палок? У четырех с половиной? у двух с четвертью?", "Сколько яиц можно съесть натощак?", "Какое слово начинается с трех букв «Г» и заканчивается тремя буквами «Я»?", "Назовите среднее арифметическое между велосипедом и мотоциклом.", "Маленький, серенький, на слона похож?", "У домбры их две, у арфы их пять, у гитары — шесть. А сколько их у пианино?", "Какой малыш рождается с усами?", "Когда человек может мчаться со скоростью гоночного автомобиля?", "Что есть у слонов и больше ни у каких животных?", "Перед кем все люди снимают шляпу?", "Как написать мышеловка пятью буквами?", "Сын моего отца, а мне не брат?", "Из какого полотна нельзя сшить рубашку?", "Какой город есть в компоте?", "В светильнике было 20 лампочек, 5 из них перегорели. Сколько лампочек осталось?", "Папа на рыбалке за 10 минут поймал 3-х рыбок. За какое время он поймает еще 10 рыбок?", "На подносе лежали 9 булочек. 9 девочек взяли по булочке. Но на подносе осталась одна булочка. Как такое получилось?", "Васе 5 лет. А Ане 9 лет. Какая разница в возрасте будет между ними через три года?", "Из леса Миша принес бабушке для грибного супа 2 белых гриба, 3 подосиновика, 4 мухомора и 5 сыроежек. Сколько грибов пригодится бабушке на суп?", "Самолет, пароход, воздушный шар, вертолет. Какое слово здесь лишнее?", "В подъезд одновременно зашли два человека. У одного квартира на 3-м этаже, у другого – на 9-м. Во сколько раз первый доедет быстрее 2-го?", "Какой объект, сделанный человеком ранее 20-го века, может двигаться быстрее звука?", "Колесо автомобиля катится вправо; обод его вертится по часовой стрелке. В какую сторону перемещается при этом воздух внутри резиновой шины колеса — навстречу вращению колеса или в том же направлении?", "Что в России на первом месте, а во Франции на втором?", "Верблюд в течение часа выдерживает ношу в 10 пудов. В течение какого времени он выдержит ношу в 1000 пудов?", "Почему загадки опасны для головы?", "Что общее может быть у снега и у кустарника сирени?", "Что делает сторож, когда у него на голове сидит воробей?", "Где находятся города без домов, реки без воды и леса без деревьев?", "В названии какой стороны света сто одна буква?", "Кто говорит на всех языках?", "С грузом идут, без груза останавливаются.", "У кого усы длиннее ног?", "Что было «завтра», а будет «вчера»?", "Шесть ног, две головы, а хвост один. Что это?", "Какие часы показывают верное время только два раза в сутки?", "Собрались как-то ребята на пикнике, всего 6 человек. Смотрят, а вместо 6 яблок они взяли 5. Как разделить яблоки поровну между всеми, чтоб никому не было обидно? Ни резать, ни ломать их нельзя.", "Если Эрика живёт в Вашингтоне, а Тина живёт в Буэнос-Айресе, то где живёт Тай?", "В 1849 году один человек поехал в Калифорнию, где бушевала «золотая лихорадка». Он надеялся разбогатеть, продавая золотоискателям палатки. Однако погода была прекрасной, и золотоискатели спали прямо под открытым небом. Никто не покупал палатки. Тем не менее продавец разбогател, и его продукция продаётся и по сей день. Как ему это удалось и как его звали?", "Шпион засел в кустах и оценивает ситуацию на КПП. Подходит офицер, часовой ему: «Пароль».\nОфицер: «26».\nЧасовой: «Отзыв».\nОфицер: «13».\nЧасовой: «Проходи».\nПодходит второй: «Пароль!» – «22».\n«Отзыв» – «11».\n«Проходи.»\nНу, шпион решил, что разгадал систему пароля, бежит к часовому.\nЧасовой: «Пароль».\nШпион: «100».\nЧасовой: «Отзыв».\nШпион: «50».\nВ общем, поймали шпиона. Какой ответ был бы правильным?", "Для каждого из следующих слов придумайте слово, имеющее такое же смысловое значение и начинающееся с буквы К:\nБогатство, Печать, Вселенная, Решётка, Очаг, Уют, Венец, Герцог, Замок, Молот.", "Врач прописал больному три таблетки и велел принимать их через каждые полчаса. Сколько времени уйдет на прием таблеток?", "Какому насекомому аплодирует весь мир?", "Она красная? – Нет, черная. А почему она белая? Потому что зеленая. Что это?", "Как можно поместить два литра молока в литровую банку?", "Шуточная задача. Едет охотник в автобусе, видит – бежит заяц. Он выстрелил. Куда он попал?", "Кто на все руки мастер?", "Как бросить теннисный мяч так, чтобы он, пролетев короткое расстояние, остановился и начал двигаться в противоположном направлении? При этом мяч не должен ударяться о препятствие, его нельзя ударять чем-нибудь или привязывать к чему-нибудь.", "Отношение возраста одного мальчика к возрасту другого мальчика несколько лет назад было таким же, как и сейчас. Какое это отношение?", "Какое наибольшее число можно написать четырьмя единицами?", "В дремучем Муромском лесу из-под земли бьют десять источников мёртвой воды, они пронумерованы от № 1 до № 10.\nИз первых девяти источников мёртвую воду может взять каждый, но источник № 10 находится в пещере Кощея, в которую никто, кроме самого Кощея, попасть не может.\nНа вкус и цвет мёртвая вода ничем не отличается от обыкновенной, однако, если человек выпьет из какого-нибудь источника, он умрёт. Спасти его может только одно: если он запьёт ядом из источника, номер которого больше. Например, если он выпьет из седьмого источника, то ему надо обязательно запить ядом № 8, № 9 или № 10. Если он выпьет не седьмой яд, а девятый, ему может помочь только яд № 10. А если он сразу выпьет десятый яд, то ему уже ничто не поможет.\nИванушка-дурачок вызвал Кощея на дуэль. Условия дуэли были такие: каждый приносит с собой кружку с жидкостью и даёт её выпить своему противнику. Кощей обрадовался: «Я дам яд № 10, и Иванушка-дурачок не сможет спастись! А сам выпью яд, который Иванушка-дурачок мне принесёт, запью его своим десятым и спасусь!»\nВ назначенный день оба противника встретились в условленном месте. Они честно обменялись кружками и выпили то, что в них было. Оказалось, что Кощей умер, а Иванушка-дурачок остался жив! Как это произошло?", "Разделите в уме на два следущее число: один секстиллиард семь", "Как разделить пять яблок между пятью людьми таким образом, чтобы одно яблоко осталось лежать в корзине? (Задача-шутка)", "Как число 66 увеличить в полтора раза, не производя над ним никаких арифметических действий?", "В пруду растет один лист лилии. Каждый день число листьев удваивается. На какой день пруд будет покрыт листьями лилии наполовину, если известно, что полностью он будет покрыт ими через 100 дней?", "Можно ли на самолете долететь до Луны? (Надо принять во внимание, что самолеты снабжены реактивными двигателями, как и космические ракеты, и работают на том же топливе, что и они.)", "Девушка уронила свое кольцо в чашку, в которой был растворимый кофе. Почему кольцо осталось сухим?", "Миссионер попал в плен к дикарям, которые посадили его в темницу и сказали: «Отсюда только два выхода — один на свободу, другой к гибели; выбраться тебе помогут два воина, — один говорит всегда правду, другой всегда лжет, но неизвестно, кто из них лжец, а кто правдолюбец; ты можешь задать любому из них только один вопрос». Какой вопрос надо задать, чтобы выбраться на свободу?", "Если три дня назад был день, предшествующий понедельнику, то какой день будет послезавтра?", "Девушка ехала в такси. По пути она так много болтала, что шофер занервничал. Он сказал ей, что очень сожалеет, но не слышит ни слова, поскольку его слуховой аппарат не работает — он глух как пробка. Девушка замолчала, но, когда они доехали до места, поняла, что водитель над ней подшутил. Как она догадалась?", "Вы находитесь в каюте стоящего на якоре океанского лайнера. В полночь вода была на 4 м ниже иллюминатора и поднималась на полметра в час. Если эта скорость удваивается каждый час, то за какое время вода достигнет иллюминатора?", "Из Москвы во Владивосток каждый день выходит поезд. Так же каждый день из Владивостока в Москву выходит поезд. Переезд длится 10 дней. Если вы выехали из Владивостока в Москву, то сколько поездов, идущих в обратном направлении, встретится вам во время поездки?", "Существует простой и дешевый способ путешествовать, которым, как это ни удивительно, никто не пользуется. Как известно, Земля вращается вокруг своей оси, причем достаточно быстро (всего за 24 часа каждая точка земного экватора проходит приблизительно 40 000 км — путь, равный длине экватора). Значит, вместо того, чтобы куда-то ехать на поезде или лететь на самолете, или плыть на корабле, нам достаточно подняться высоко над землей на воздушном шаре или дирижабле и какое-то время там неподвижно находиться. За это время Земля повернется к нам другой частью своей поверхности и надо будет всего лишь спуститься в нужное место. Верно ли это рассуждение? Если нет, то какая ошибка в нем допущена?", "Возможно ли вскипятить воду на открытом пламени в бумажной коробке?", "В одном классе ученики разделились на две группы. Одни должны были всегда говорить только правду, а другие — только неправду. Все ученики класса написали сочинение на свободную тему, которое должно было заканчиваться фразой: «Все, здесь написанное, правда» или «Все, здесь написанное, ложь». В классе было 17 правдолюбцев и 18 лжецов. Сколько получилось сочинений с утверждением о правдивости написанного?", "Сколько у вас было всего всего прапрадедушек и прапрабабушек?", "Диалог в магазине хозяйственных товаров:\n— Сколько стоит один?\n— 20 рублей, — ответил продавец.\n— Сколько стоит 12?\n— 40 рублей.\n— Хорошо, дайте мне 120.\n— Пожалуйста, с вас 60 рублей.\nЧто покупал посетитель?\nБутылка с пробкой стоит 1 р. 10 к. Бутылка дороже пробки на 1 р. Сколько стоит бутылка и сколько стоит пробка?", "Катя живёт на четвёртом этаже, а Оля – на втором. Поднимаясь на четвёртый этаж, Катя преодолевает 60 ступенек. Сколько ступенек надо пройти Оле, чтобы подняться на второй этаж?", "Каким образом из кружки, ковшика, кастрюли и любой другой посуды правильной цилиндрической формы, наполненной до краёв водой, отлить ровно половину, не используя никаких измерительных приборов?", "Три курицы несут три яйца за три дня. Сколько яиц снесут 12 куриц за 12 дней?", "Назовите два числа, у которых количество цифр равно количеству букв, составляющих название каждого из этих чисел.", "«Ручаюсь, – сказал продавец в зоомагазине, – что этот попугай будет повторять любое услышанное слово». Обрадованный покупатель приобрёл чудо-птицу, но, придя домой, обнаружил, что попугай нем, как рыба. Тем не менее, продавец не лгал. Как такое возможно? (Задача-шутка.)", "В комнате есть свеча и керосиновая лампа. Что вы зажжёте первым, когда вечером войдёте в эту комнату?", "Половина от половины числа равна половине. Какое это число?", "Со временем человек обязательно побывает на Марсе. Саша Иванов – это человек. Следовательно, Саша Иванов со временем обязательно побывает на Марсе. Верно ли это рассуждение? Если нет, то какая ошибка в нём допущена?", "Часто говорят, что композитором, или художником, или писателем, или учёным надо родиться. Верно ли это? Действительно ли композитором (художником, писателем, учёным) надо родиться? (Задача-шутка.)", "Для того чтобы видеть, совсем не обязательно иметь глаза. Без правого глаза мы видим. Без левого тоже видим. А поскольку кроме левого и правого глаза других глаз у нас нет, то оказывается, что ни один глаз не является необходимым для зрения. Верно ли это утверждение? Если нет, то какая ошибка в нём допущена?", "Попугай прожил меньше 100 лет и умеет отвечать только на вопросы «да» и «нет». Сколько вопросов ему надо задать, чтобы узнать его возраст?", "Один человек, попавший в неволю, рассказывает следующее: «Моя темница находилась в верхней части замка. После многодневных усилий мне удалось выломать один из прутьев в узком окне. В образовавшееся отверстие можно было пролезть, но расстояние до земли было слишком велико, чтобы просто спрыгнуть вниз. В углу темницы я обнаружил забытую кем-то верёвку. Однако она оказалась слишком короткой, чтобы можно было спуститься по ней. Тогда я вспомнил, как один мудрец удлинял слишком короткое для него одеяло, обрезав часть его снизу и пришив её сверху. Поэтому я поспешил разделить верёвку пополам и снова связать две образовавшиеся части. Тогда она стала достаточно длинной, и я благополучно спустился по ней вниз». Каким образом рассказчику удалось это сделать?", "Составьте вопрос из пяти стоящих подряд букв русского алфавита. Подсказка: возможно это будет не одно слово.", "Перед вами электронные часы. Сколько раз в сутки они будут показывать время так, что все ячейки на циферблате (часы, минуты, секунды) будут заполнены одной и той же цифрой?", "Мужчина ночью долго ворочался в кровати и никак не мог заснуть…\nПотом он взял телефон, набрал чей-то номер, прослушав несколько длинных гудков — положил трубку и спокойно заснул. Вопрос: почему он до этого не мог заснуть?", "Карандаш положили на пол и попросили нескольких человек перепрыгнуть через него. Но никто не смог этого сделать. Почему?", "Как нужно бросить мяч, чтобы он точно прилетел к вам обратно?", "Джордж Вашингтон, Шерлок Холмс, Уильям Шекспир, Людвиг Ван Бетховен, Наполеон Бонапарт и Нерон – кто из них принципиально отличается от других?", "Представьте себе: 6-километровый мост, который выдерживает ровно 25 тонн. Полностью снаряженная фура, включая водителя, которая весит 25 тонн, едет по мосту. В середине моста на фуру сел 30-грамовый воробей. Мост при этом не рушится. Почему?", "Я был приглашен на вечеринку. Там я увидел человека с очень редкими часами. Откуда я знаю, что эти часы были украдены?", "8 + 7 = 13 или 7 + 8 = 13?", "У фрау и герр Майерс есть 4 дочери. У каждой дочери есть один брат. Сколько всего детей у Майерсов?"];
    
    var offset = 0;
    window.alreadySet = false;

    function createEventTenant(phone, name, data) {
        var epxGlob = ''
        let objId = 18
        let tk = 'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpc3MiOiJkb21vdGVsX3N0YXRzIiwibmJmIjoxNzE4MzYxODY2LCJleHAiOjEwMTcxMDc4MTA2NiwidWlkIjoiYmQyYWZjYTEtYmZmNi00NWM3LTlhNTEtYTQ2ZWNlMjBjNGZmIiwic3ViIjoid2lkZ2V0cyIsIm9ianV1aWQiOiJkODQ2NmM0Yi0wYTk3LTQzM2QtOTk4Yy02NmFkZjIwNzI1NGYiLCJ1c2VydXVpZCI6IiJ9.wGgtRB-6kIAL4T1sSyYDN94YUIYyIsMs7iAIq1X9Jac'
        let forValEvents = { phone, name, data }


        let details = {
            'ApplicationId': 2,
            'ObjectId': objId,
            'StatusId': 3,
            'ActionName': 'сообщение с сайта',
            'Value': JSON.stringify(forValEvents),
        }
        var formBody = [];
        for (var property in details) {
            var encodedKey = encodeURIComponent(property);
            var encodedValue = encodeURIComponent(details[property]);
            formBody.push(encodedKey + "=" + encodedValue);
        }
        formBody = formBody.join("&");

        fetch("https://domotel_stats-admin.mobsted.ru/api/v8/events", {
            method: "POST",
            body: formBody,
            headers: {
                // 'Content-Type': 'application/json;charset=utf-8',
                // 'Content-Type': 'text/plain;charset=UTF-8',
                'Content-Type': 'application/x-www-form-urlencoded',
                "authorization": "Bearer " + tk
            }
        }).then((responseNew) => responseNew.json())
            .then((resJson) => {

                //console.log('c event json - ',resJson)

            });

    }


    function createExpression() {

        let arr = ["+", "-"];
        let arr9 = ["плюс", "минус"];
        let sig = arr9[(Math.floor(Math.random() * arr9.length))];
        let arr0 = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"];
        let arr1 = ["ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять", "десять"];
        let num1 = arr0[(Math.floor(Math.random() * arr0.length))];
        let num2 = arr1[(Math.floor(Math.random() * arr1.length))];
        return ''+num1+' '+sig+' '+num2+'=';
    }

    function getLines( text, maxWidth, ctx = null) {
    var words = text.split(" ");
    var lines = [];
    var currentLine = words[0];

    for (var i = 1; i < words.length; i++) {
        var word = words[i];

        var width = 500;
        if (ctx){
            width = ctx.measureText(currentLine + " " + word).width;
        }
        
        if (width < maxWidth) {
            currentLine += " " + word;
        } else {
            lines.push(currentLine);
            currentLine = word;
        }
    }
    lines.push(currentLine);
    return lines;
    }

    var globalCreatedCaptcha = 0;
    //data{"source":"beeline","comment":""}
    function createCatcha() {

        var forms = document.getElementsByClassName("form__form");
        Array.from(forms).forEach((element) => {
            var buttons = element.getElementsByClassName("button button_width_block");
            Array.from(buttons).forEach((element1) => {
                if (element1.innerText == 'Заказать звонок') {

                    if (globalCreatedCaptcha == 99) return


                    epxGlob = createExpression();
                    const random = Math.floor(Math.random() * haha130.length);
                    epxGlob = haha130[random]
                    let lines = getLines(epxGlob,600)
                    let y1 = 10;
                    lines.forEach(function (text) {  
                        y1 = y1 + 10;
                    });
                    
                    y1 = y1 + 40;
                    let y2 = y1 + 100;
                    var div = document.createElement("div");
                    div.style.width = "100%";
                    div.style.height = ""+(y2)+"px";
                    // div.style.background = "red"; border:1px solid #d3d3d3;
                    div.style.color = "var(--color-brand-text)";
                    div.id = "containerCanvas"
                    element1.parentElement.insertBefore(div, element1.parentElement.childNodes[0]);

                    let j = document.getElementById("containerCanvas");
                    j.innerHTML = '<span style="font-size: 14px;line-height: 1.5;font-weight: 400;color: var(--color-brand-text);">ответьте на вопрос:</span><br><canvas id="myCanvas" width="570px" height="'+(y1)+'px" style="display:none;paddig:20px"></canvas><canvas id="canvas" width="570px" height="'+(y1)+'px" style="paddig:20px"></canvas><input type="text" class="input__input" name="code[field67]" id="id-code" aria-label="ответ" placeholder="ответ" data-validate-required="true" data-validate-name="code" data-validate-required-ms="решите пример" data-init="true">';

                    // let c = document.getElementById("myCanvas");
                    // let ctx = c.getContext("2d");
                    // ctx.font = "10px Arial";
                    
                    // v1
                    // lines = getLines(epxGlob,600, ctx)
                    // y1 = 10;
                    // lines.forEach(function (text) {
                    //     //console.log(text)
                    //     ctx.fillText(text, 10, y1, 1000);
                    //     y1 = y1 + 10;
                    // });


                    // v2
                    epxGlob = createExpression();
                    // ctx.fillText(epxGlob, 20, 50);
                    

                    // v3
                    const canvas = document.getElementById("myCanvas");
                    const ctx = canvas.getContext("2d");

                    var w = ctx.canvas.width,
                        h = ctx.canvas.height,
                        idata = ctx.getImageData(0, 0, w, h),
                        buffer32 = new Uint32Array(idata.data.buffer),
                        len = buffer32.length,
                        i = 0,
                        pr = 456 * Math.random(),
                        prs = 716 * Math.random();;

                    for(; i < len;) {
                        buffer32[i++] = (((pr % 255)|0) << 24) | 0x440000;
                        pr += prs * 1.2;
                    }

                    ctx.putImageData(idata, 0, 0);
                    
                    for(i = 0; i < w; i += 2) {
                        let y = i * Math.sin((i + (offset++)) /100);
                        ctx.drawImage(ctx.canvas, i,0, 1, h,  i, y, 1, h);
                    }

                    let  x, y,
                    number,
                    opacity = .9;


                    ctx.font = "36px sans";
                    ctx.textAlign = "center";
                    ctx.textBaseline = "middle";
                    // ctx.fillStyle = "#0";

                    number1 = Math.floor( Math.random() * 255 );
                    number2 = Math.floor( Math.random() * 255 );
                    number3 = Math.floor( Math.random() * 255 );

                    ctx.fillStyle = "rgba(" + number1 + "," + number2 + "," + number3 + "," + opacity + ")";

                    ctx.fillText(epxGlob, canvas.width / 2, canvas.height / 2);



                    async function makeArc(image, angle, rotate = 0) {
                    let result = await lens.distort(
                        image,
                        lens.Distortion.ARC, [angle, rotate], {
                        imageVirtualPixelMethod: angle === 360 ? lens.VirtualPixelMethod.HORIZONTAL_TILE : lens.VirtualPixelMethod.TRANSPARENT
                        }
                    );

                    let tempCanv = document.getElementById("canvas");
                    let tempCtx = tempCanv.getContext('2d');
                

                    tempCanv.width = result.image.width;
                    tempCanv.height = 70;
                    tempCtx.putImageData(result.image.imageData, 0, 0);

                    //add noise
                    if(0)
                    for ( x = 0; x < tempCanv.width; x++ ) {
                        for ( y = 0; y < tempCanv.height; y++ ) {
                            number1 = Math.floor( Math.random() * 255 );
                            number2 = Math.floor( Math.random() * 255 );
                            number3 = Math.floor( Math.random() * 255 );
                            // number4 = Math.floor( Math.random() * 255 );
                    
                            tempCtx.fillStyle = "rgba(" + number1 + "," + number2 + "," + number3 + "," + opacity + ")";
                            tempCtx.fillRect(x, y, 1, 1);
                        }
                    }

                    }

                    makeArc(canvas, 10, 0);
                    // makeArc(canvas, getRandomArbitrary(150,360), getRandomArbitrary(-10,10));

                    
                    globalCreatedCaptcha = 99;

                }
            });
        });

    }


    setTimeout(function () {
        // let element3 = document.querySelector('[data-href="zakazat-zvonok"]');
        let element3 = document.getElementsByClassName("button-circle header__mobile-phone j-popup-callback");
        if (typeof element3 !== undefined)
            if (typeof element3 !== null)
                Array.from(element3).forEach((element31) => {
                    
                    try {
                        element31.addEventListener("click", (event) => {
                            startTimerCatchFormCallingMe();
                            // console.log('-------------click button-circle')
                            globalCreatedCaptcha = 0;
                            setTimeout(function () {
                                createCatcha();
                            }, 400);
                        });
                    } catch (e) {
                        console.log('e451', e)
                    }
                });
        element3 = document.getElementsByClassName("button header__callback-button j-popup-callback");
        if (typeof element3 !== undefined)
            if (typeof element3 !== null)
                Array.from(element3).forEach((element31) => {
                    
                    try {
                        element31.addEventListener("click", (event) => {
                            startTimerCatchFormCallingMe();
                            // console.log('-------------button header')
                            globalCreatedCaptcha = 0;
                            setTimeout(function () {
                                createCatcha();
                            }, 400);
                        });
                    } catch (e) {
                        console.log('e452', e)
                    }
                });
    }, 1500);


        function getRandomArbitrary(min, max) {
            return Math.random() * (max - min) + min;
        }

        function sleepFor(sleepDuration) {
            var now = new Date().getTime();
            while (new Date().getTime() < now + sleepDuration) { /* Do nothing */ }
        }   

    function startTimerCatchFormCallingMe() {


        var timer1 = setInterval(function () {


            var forms = document.getElementsByClassName("form__form");
            Array.from(forms).forEach((element) => {
                var buttons = element.getElementsByClassName("button button_width_block");
                Array.from(buttons).forEach((element1) => {
                    if (element1.innerText == 'Заказать звонок') {

                        clearInterval(timer1);
                        createCatcha();
                        if (!window.alreadySet) 
                        element1.addEventListener("click", (event) => {

                            element1.style.display = 'none';
                            sleepFor(getRandomArbitrary(100,1000))

                            var name1 = ''
                            var phone1 = ''
                            var code1 = ''

                            let names1 = document.getElementsByName('zakazat-zvonok[field2]')
                            let phones1 = document.getElementsByName('zakazat-zvonok[field1]')
                            let codes1 = document.getElementsByName('code[field67]')

                            Array.from(codes1).forEach((code1elem) => {
                                code1 = code1elem.value;
                            });
                            Array.from(names1).forEach((name1elem) => {
                                name1 = name1elem.value;
                            });
                            Array.from(phones1).forEach((phone1elem) => {
                                phone1 = phone1elem.value;
                            });

                            // if (name1.length == 0) console.log('empty name')
                            // if (phone1.length == 0) console.log('empty phone')
                            // if (code1.length == 0) console.log('empty code')

                            if (name1.length == 0) return
                            if (phone1.length == 0) return
                            if (code1.length == 0) return


                            
                            if (phone1.substring(1, 4) == '967') return
                            if (phone1.substring(1, 5) == ' 967') return
                            if (phone1.substring(1, 5) == '7967') return
                            if (phone1.substring(1, 5) == ' 967') return
                            if (phone1.substring(1, 5) == '7967') return
                            if (phone1.substring(1, 6) == '7 967') return
                            if (phone1.substring(2, 7) == '7 967') return
                            if (phone1.indexOf('(967') !== -1) return
                            if (phone1.indexOf('967)') !== -1) return

                            var dataforsend = {
                                url: window.location.href
                            }

                            let utmsMarks = document.cookie.split(';').filter(function (c) {
                                return c.trim().indexOf('get_utm_mark_') === 0;
                            }).map(function (c) {
                                return c.trim();
                            });

                            var hasSource = false;
                            var source_my = '';

                            for (let utmMark of utmsMarks) {
                                let arrUtm = utmMark.split('=')
                                if (arrUtm.length == 2) {

                                    if (arrUtm[0].indexOf('get_utm_mark_') == -1)
                                        continue

                                    let nameUtm = arrUtm[0].replace('get_utm_mark_', '')
                                    if (nameUtm.toLowerCase() == 'source_my') {
                                        source_my = arrUtm[1]
                                        continue
                                    }

                                    if ((nameUtm.toLowerCase() == 'source') && (arrUtm[1].length > 0)) {
                                        hasSource = true
                                    }

                                    dataforsend[nameUtm] = arrUtm[1]
                                }
                            }

                            if (hasSource) { } else {
                                dataforsend['source'] = source_my
                            }
                            
                            dataforsend['comment'] = " " + epxGlob + " " + code1;

                            let res1 = fetch("https://do72.4dev.app/do72api/hs/extint/send", {
                                method: "POST",
                                body: JSON.stringify({
                                    requestType: "call",
                                    typeform: "01",
                                    dateTime: "112345678",
                                    contacts: {
                                        phone: phone1,
                                        name: name1
                                    },
                                    data: dataforsend

                                }),
                                headers: {
                                    "Content-type": "text/plain; charset=UTF-8"
                                }
                            });

                            // console.log(res1)
                            createEventTenant(phone1, name1, JSON.stringify(dataforsend))
                        });
                        window.alreadySet = true;
                    } else {
                    }
                });
            });


        }, 1000);

    }


    startTimerCatchFormCallingMe();

</script>